{
	"version": "https://jsonfeed.org/version/1",
	"title": "Sarvagnan's Blog",
	"icon": "https://micro.blog/sarvagnan/avatar.jpg",
	"home_page_url": "https://blog.sarvagnan.com/",
	"feed_url": "https://blog.sarvagnan.com/feed.json",
	"items": [
		
			{
				"id": "http://sarvagnan.micro.blog/2021/05/24/finished-reading-redshirts.html",
				
				"content_html": "<p>Finished reading: <a href=\"https://micro.blog/books/9780575134294\">Redshirts</a> by John Scalzi 📚</p>\n",
				"content_text": "Finished reading: [Redshirts](https://micro.blog/books/9780575134294) by John Scalzi 📚\n",
				"date_published": "2021-05-24T10:39:52+05:30",
				"url": "https://blog.sarvagnan.com/2021/05/24/finished-reading-redshirts.html"
			},
			{
				"id": "http://sarvagnan.micro.blog/2021/05/21/finished-reading-the.html",
				
				"content_html": "<p>Finished reading: The Assassins of Thasalon by Lois McMaster Bujold 📚</p>\n\n<p>(Side note: This one, like the previous book, also doesn&rsquo;t seem to have an ISBN)</p>\n",
				"content_text": "Finished reading: The Assassins of Thasalon by Lois McMaster Bujold 📚\n\n(Side note: This one, like the previous book, also doesn't seem to have an ISBN)\n",
				"date_published": "2021-05-21T15:10:52+05:30",
				"url": "https://blog.sarvagnan.com/2021/05/21/finished-reading-the.html"
			},
			{
				"id": "http://sarvagnan.micro.blog/2021/05/18/finished-reading-masquerade.html",
				
				"content_html": "<p>Finished reading: Masquerade in Lodi by Lois McMaster Bujold 📚</p>\n\n<p>(Side note: This doesn&rsquo;t seem to have an ISBN and also seems to be listed only on Amazon. Weird)</p>\n",
				"content_text": "Finished reading: Masquerade in Lodi by Lois McMaster Bujold 📚\n\n(Side note: This doesn't seem to have an ISBN and also seems to be listed only on Amazon. Weird)\n",
				"date_published": "2021-05-18T16:28:52+05:30",
				"url": "https://blog.sarvagnan.com/2021/05/18/finished-reading-masquerade.html"
			},
			{
				"id": "http://sarvagnan.micro.blog/2021/05/17/finished-reading-fugitive.html",
				
				"content_html": "<p>Finished reading: <a href=\"https://micro.blog/books/9781250765376\">Fugitive Telemetry (The Murderbot Diaries, 6)</a> by Martha Wells 📚</p>\n",
				"content_text": "Finished reading: [Fugitive Telemetry (The Murderbot Diaries, 6)](https://micro.blog/books/9781250765376) by Martha Wells 📚\n",
				"date_published": "2021-05-17T01:12:17+05:30",
				"url": "https://blog.sarvagnan.com/2021/05/17/finished-reading-fugitive.html"
			},
			{
				"id": "http://sarvagnan.micro.blog/2021/05/15/finished-reading-darkened.html",
				
				"content_html": "<p>Finished reading: <a href=\"https://micro.blog/books/9780425270011\">Darkened Blade (A Fallen Blade Novel)</a> by Kelly McCullough 📚</p>\n",
				"content_text": "Finished reading: [Darkened Blade (A Fallen Blade Novel)](https://micro.blog/books/9780425270011) by Kelly McCullough 📚\n",
				"date_published": "2021-05-15T02:26:16+05:30",
				"url": "https://blog.sarvagnan.com/2021/05/15/finished-reading-darkened.html"
			},
			{
				"id": "http://sarvagnan.micro.blog/2021/05/15/finished-reading-drawn.html",
				
				"content_html": "<p>Finished reading: <a href=\"https://micro.blog/books/9780425270004\">Drawn Blades (Fallen Blade, #5)</a> by Kelly McCullough 📚</p>\n",
				"content_text": "Finished reading: [Drawn Blades (Fallen Blade, #5)](https://micro.blog/books/9780425270004) by Kelly McCullough 📚\n",
				"date_published": "2021-05-15T02:18:44+05:30",
				"url": "https://blog.sarvagnan.com/2021/05/15/finished-reading-drawn.html"
			},
			{
				"id": "http://sarvagnan.micro.blog/2021/04/17/i-started-watching.html",
				
				"content_html": "<p>I started watching James Hoffmann&rsquo;s videos after Kenji López-Alt highlighted one of his videos (<a href=\"https://www.youtube.com/watch?v=vnfxk_slKIk&amp;t=350s\">Steam Wand Scrambled Eggs</a>). His video on <a href=\"https://www.youtube.com/watch?v=jBXm8fCWdo8\">understanding the Aeropress</a> is a showcase of everything I love about his channel. ☕️</p>\n",
				"content_text": "I started watching James Hoffmann's videos after Kenji López-Alt highlighted one of his videos ([Steam Wand Scrambled Eggs] (https://www.youtube.com/watch?v=vnfxk_slKIk&t=350s)). His video on [understanding the Aeropress] (https://www.youtube.com/watch?v=jBXm8fCWdo8) is a showcase of everything I love about his channel. ☕️\n",
				"date_published": "2021-04-17T20:17:00+05:30",
				"url": "https://blog.sarvagnan.com/2021/04/17/i-started-watching.html"
			},
			{
				"id": "http://sarvagnan.micro.blog/2021/04/06/signal-vs-whatsapp.html",
				"title": "Signal vs WhatsApp",
				"content_html": "\n\n<p>With all of the hubbub about WhatsApp&rsquo;s new privacy policy, a whole bunch of people switched to Signal. As someone who&rsquo;s been trying to get people to switch to Signal for years (for my own selfish reasons; I&rsquo;ve wanted to try the app but can&rsquo;t do so with just myself), I&rsquo;ve viewed this as a good thing. However, I can&rsquo;t switch apps wholesale as a lot of people I know still use WhatsApp, plus all of my work chats are there. After using both for sometime, here are a few pros and cons I&rsquo;ve found with both.</p>\n\n<h2 id=\"whatsapp-feature-bloat\">WhatsApp: Feature Bloat</h2>\n\n<p>This has been discussed ad nauseum in other places so I&rsquo;ll try to keep this short. There is just too much going on in WhatsApp. I get where Facebook is coming from on this though as I know a lot of people who manage their lives on WhatsApp.</p>\n\n<h2 id=\"signal-reliability\">Signal: Reliability</h2>\n\n<p>Signal seems to have issues with messages actually going through. A friend and I had numerous issues with chats and photos. I&rsquo;m not entirely sure why. Which leads me to the next point.</p>\n\n<h2 id=\"signal-cross-platform-consistency\">Signal: Cross-platform consistency</h2>\n\n<p>Signal has apps for all the major platforms. However, actually syncing activity between two different platforms is a different story entirely. They have an explanation for why they don&rsquo;t sync chats on first launch but this doesn&rsquo;t hold water in my opinion. It is entirely possible to have peer to peer syncing between your own clients and based on their privacy stance, this is something that I would have expected them to build. At this stage though, it is left up to chance as to what messages you see where.</p>\n\n<h2 id=\"signal-the-someone-is-on-signal-notifications\">Signal: The &ldquo;Someone is on Signal&rdquo; notifications</h2>\n\n<p>These are just plain annoying. At the start, Signal tells you about everyone in your contacts who is on the app. I would have expected this to be disabled by default at least.</p>\n\n<h2 id=\"whatsapp-spam\">WhatsApp: Spam</h2>\n\n<p>This is probably because there are way more people who use WhatsApp than Signal, but spam is a major issue. I get random messages from people and I have no idea how to prevent this. I don&rsquo;t want it to be impossible for people outside my contacts to reach me and I&rsquo;m not sure how you&rsquo;d get rid of spam without compromising the privacy features of the app. This is a thorny one.</p>\n\n<p>Up until some time ago, I had WhatsApp&rsquo;s inability to make calls from the desktop on this list, but they have since added this.</p>\n\n<p>This is all that comes to mind right now; I&rsquo;ll keep adding to this as more things come up or as some of this is fixed.</p>\n",
				"content_text": "With all of the hubbub about WhatsApp's new privacy policy, a whole bunch of people switched to Signal. As someone who's been trying to get people to switch to Signal for years (for my own selfish reasons; I've wanted to try the app but can't do so with just myself), I've viewed this as a good thing. However, I can't switch apps wholesale as a lot of people I know still use WhatsApp, plus all of my work chats are there. After using both for sometime, here are a few pros and cons I've found with both.\n\n## WhatsApp: Feature Bloat\n\nThis has been discussed ad nauseum in other places so I'll try to keep this short. There is just too much going on in WhatsApp. I get where Facebook is coming from on this though as I know a lot of people who manage their lives on WhatsApp.\n\n## Signal: Reliability\n\nSignal seems to have issues with messages actually going through. A friend and I had numerous issues with chats and photos. I'm not entirely sure why. Which leads me to the next point.\n\n## Signal: Cross-platform consistency\n\nSignal has apps for all the major platforms. However, actually syncing activity between two different platforms is a different story entirely. They have an explanation for why they don't sync chats on first launch but this doesn't hold water in my opinion. It is entirely possible to have peer to peer syncing between your own clients and based on their privacy stance, this is something that I would have expected them to build. At this stage though, it is left up to chance as to what messages you see where.\n\n## Signal: The \"Someone is on Signal\" notifications\n\nThese are just plain annoying. At the start, Signal tells you about everyone in your contacts who is on the app. I would have expected this to be disabled by default at least.\n\n## WhatsApp: Spam\n\nThis is probably because there are way more people who use WhatsApp than Signal, but spam is a major issue. I get random messages from people and I have no idea how to prevent this. I don't want it to be impossible for people outside my contacts to reach me and I'm not sure how you'd get rid of spam without compromising the privacy features of the app. This is a thorny one.\n\nUp until some time ago, I had WhatsApp's inability to make calls from the desktop on this list, but they have since added this.\n\nThis is all that comes to mind right now; I'll keep adding to this as more things come up or as some of this is fixed.\n\n\n",
				"date_published": "2021-04-06T13:08:46+05:30",
				"url": "https://blog.sarvagnan.com/2021/04/06/signal-vs-whatsapp.html"
			},
			{
				"id": "http://sarvagnan.micro.blog/2021/03/18/as-a-duckduckgo.html",
				
				"content_html": "<p>As a DuckDuckGo user, I don&rsquo;t see much of Google on a day to day basis. However, I found today that they seem to show key moments in YouTube videos even if the video does not have chapters. I&rsquo;m not sure how they&rsquo;re doing this but it is super interesting to see.</p>\n\n<p><img src=\"uploads/2021/482b6f40b4.png\" width=\"600\" height=\"222\" alt=\"Screenshot of Google Search Results Showing Key Moments in a YouTube Video\" /></p>\n",
				"content_text": "As a DuckDuckGo user, I don't see much of Google on a day to day basis. However, I found today that they seem to show key moments in YouTube videos even if the video does not have chapters. I'm not sure how they're doing this but it is super interesting to see.\n\n<img src=\"uploads/2021/482b6f40b4.png\" width=\"600\" height=\"222\" alt=\"Screenshot of Google Search Results Showing Key Moments in a YouTube Video\" />\n",
				"date_published": "2021-03-18T13:29:18+05:30",
				"url": "https://blog.sarvagnan.com/2021/03/18/as-a-duckduckgo.html"
			},
			{
				"id": "http://sarvagnan.micro.blog/2021/03/15/whatever-you-may.html",
				
				"content_html": "<p>Whatever you may think of Apple ads, their music is always great (for me at least). They&rsquo;re one of the few companies that actually has a link to the music in the description too. The latest ad: <a href=\"https://www.youtube.com/watch?v=BaLHthRsqQk\">www.youtube.com/watch</a> 🎵</p>\n",
				"content_text": "Whatever you may think of Apple ads, their music is always great (for me at least). They're one of the few companies that actually has a link to the music in the description too. The latest ad: [www.youtube.com/watch](https://www.youtube.com/watch?v=BaLHthRsqQk) 🎵\n",
				"date_published": "2021-03-15T12:28:39+05:30",
				"url": "https://blog.sarvagnan.com/2021/03/15/whatever-you-may.html"
			},
			{
				"id": "http://sarvagnan.micro.blog/2021/02/24/finished-reading-the.html",
				
				"content_html": "<p>Finished reading: <a href=\"https://micro.blog/books/9780333725030\">The Naked God</a> by Peter F. Hamilton 📚</p>\n",
				"content_text": "Finished reading: [The Naked God](https://micro.blog/books/9780333725030) by Peter F. Hamilton 📚\n",
				"date_published": "2021-02-24T16:30:25+05:30",
				"url": "https://blog.sarvagnan.com/2021/02/24/finished-reading-the.html"
			},
			{
				"id": "http://sarvagnan.micro.blog/2021/02/23/an-idea-a.html",
				
				"content_html": "<p>An idea a friend and I came up with today (most probably others have had this as well). In India, we have a lot of social welfare schemes that employ unskilled people in manual labour. We also require a lot of semi-skilled workers in other settings, like helping staff in schools. These roles are currently not filled or are being done by other employees as an additional task (in the school example, the teacher takes care of everything).The former is guaranteed labour for a short period of time while the latter is more or less long term government employment with associated regular pay. The government has records for the former. Why not try and get the people who avail the social scheme into the semi-skilled employment sector? They are both government managed and the government has the records to identify people that can work in this area. Just something to consider.</p>\n",
				"content_text": "An idea a friend and I came up with today (most probably others have had this as well). In India, we have a lot of social welfare schemes that employ unskilled people in manual labour. We also require a lot of semi-skilled workers in other settings, like helping staff in schools. These roles are currently not filled or are being done by other employees as an additional task (in the school example, the teacher takes care of everything).The former is guaranteed labour for a short period of time while the latter is more or less long term government employment with associated regular pay. The government has records for the former. Why not try and get the people who avail the social scheme into the semi-skilled employment sector? They are both government managed and the government has the records to identify people that can work in this area. Just something to consider.\n",
				"date_published": "2021-02-23T22:24:26+05:30",
				"url": "https://blog.sarvagnan.com/2021/02/23/an-idea-a.html"
			},
			{
				"id": "http://sarvagnan.micro.blog/2020/08/10/media-diet-and.html",
				"title": "Media Diet - 08 and 09 August 2020 🍿📺",
				"content_html": "<p>Spent Saturday night and Sunday drowning out my internal monologue with a movie and two tv shows. This is the first time in a while that I&rsquo;ve actually sat down and binged movies and TV. I think I&rsquo;ve become a little jaded when it comes to this form of media; whatever time was previously spent on this is now devoted mostly to books.</p>\n\n<p><strong>Birds of Prey</strong>:</p>\n\n<p>TL;DR: Meh</p>\n\n<p>Longer Version: Whenever I watch movies of the superhero variety, it seems like they are becoming more and more like games. There&rsquo;s an exploration phase where you build out the story, then you meet the big boss, you have a team, then there is a boss fight. The seams are also readily visible; visualizing the movie as a game, you can tell where the cut scenes would be. Birds of Prey readily fit into this mould.</p>\n\n<p><strong>Fleabag</strong>:</p>\n\n<p>TL;DR: Excellent</p>\n\n<p>Longer Version: If someone asks for the perfect TV show, point them to this. Everything about this is amazing; the humour, each beat, the editing, the storyline. I had this on my watchlist for ages (see aforementioned jadedness) and then spent the day kicking myself for not watching it earlier. A few highlights: the names given to characters, breaking the fourth wall and then breaking that mechanic too, the brokenness of the main character and how that&rsquo;s approached; I could go on and on. Watch this show and revel in its greatness.</p>\n\n<p><strong>Killing Eve</strong>:</p>\n\n<p>TL;DR: S1: Good, S2 &amp; 3: Fluctuates between meh and good</p>\n\n<p>Longer Version: I started watching this because it&rsquo;s in the Phoebe Waller-Bridge universe, and you can see her fingerprints all over season one. The storytelling is tight but there a lot of elements to the plot that seem extraneous. The extraneous parts were multiplied in S2 and S3, with the worst parts of S2 devolving into a buddy cop drama. When it works, it is a great show with the chemistry between the main leads really shining through. When it doesn&rsquo;t work though, it is a slog. I was grateful for the forward skip button at multiple points. Bottom line: watch this if you want more Phoebe Waller-Bridge, just don&rsquo;t expect more Fleabag.</p>\n",
				"content_text": "Spent Saturday night and Sunday drowning out my internal monologue with a movie and two tv shows. This is the first time in a while that I've actually sat down and binged movies and TV. I think I've become a little jaded when it comes to this form of media; whatever time was previously spent on this is now devoted mostly to books. \n\n**Birds of Prey**:\n\nTL;DR: Meh\n\nLonger Version: Whenever I watch movies of the superhero variety, it seems like they are becoming more and more like games. There's an exploration phase where you build out the story, then you meet the big boss, you have a team, then there is a boss fight. The seams are also readily visible; visualizing the movie as a game, you can tell where the cut scenes would be. Birds of Prey readily fit into this mould.\n\n**Fleabag**:\n\nTL;DR: Excellent\n\nLonger Version: If someone asks for the perfect TV show, point them to this. Everything about this is amazing; the humour, each beat, the editing, the storyline. I had this on my watchlist for ages (see aforementioned jadedness) and then spent the day kicking myself for not watching it earlier. A few highlights: the names given to characters, breaking the fourth wall and then breaking that mechanic too, the brokenness of the main character and how that's approached; I could go on and on. Watch this show and revel in its greatness.\n\n**Killing Eve**:\n\nTL;DR: S1: Good, S2 & 3: Fluctuates between meh and good\n\nLonger Version: I started watching this because it's in the Phoebe Waller-Bridge universe, and you can see her fingerprints all over season one. The storytelling is tight but there a lot of elements to the plot that seem extraneous. The extraneous parts were multiplied in S2 and S3, with the worst parts of S2 devolving into a buddy cop drama. When it works, it is a great show with the chemistry between the main leads really shining through. When it doesn't work though, it is a slog. I was grateful for the forward skip button at multiple points. Bottom line: watch this if you want more Phoebe Waller-Bridge, just don't expect more Fleabag.\n",
				"date_published": "2020-08-10T13:53:00+05:30",
				"url": "https://blog.sarvagnan.com/2020/08/10/media-diet-and.html"
			},
			{
				"id": "http://sarvagnan.micro.blog/2020/08/08/finished-reading-ants.html",
				
				"content_html": "<p>Finished reading: <a href=\"https://micro.blog/books/9789353025038\">Ants among Elephants: An Untouchable Family and the Making of Modern India</a> by Sujatha Gidla 📚</p>\n",
				"content_text": "Finished reading: [Ants among Elephants: An Untouchable Family and the Making of Modern India](https://micro.blog/books/9789353025038) by Sujatha Gidla 📚\n",
				"date_published": "2020-08-08T16:09:22+05:30",
				"url": "https://blog.sarvagnan.com/2020/08/08/finished-reading-ants.html",
				"tags": ["nonfiction","biography","great"]
			},
			{
				"id": "http://sarvagnan.micro.blog/2020/08/07/brian-phillips-on.html",
				
				"content_html": "<p><a href=\"https://www.theringer.com/2020/8/7/21358082/david-silva-manchester-city-champions-league-real-madrid\">Brian Phillips on David Silva</a></p>\n\n<p>Is there a word or phrase to describe someone who is a fan of the media that the various sports generate rather than the sports themselves?\n⚽️</p>\n",
				"content_text": "[Brian Phillips on David Silva] (https://www.theringer.com/2020/8/7/21358082/david-silva-manchester-city-champions-league-real-madrid)\r\n\r\nIs there a word or phrase to describe someone who is a fan of the media that the various sports generate rather than the sports themselves?\r\n⚽️\n",
				"date_published": "2020-08-07T18:16:12+05:30",
				"url": "https://blog.sarvagnan.com/2020/08/07/brian-phillips-on.html"
			},
			{
				"id": "http://sarvagnan.micro.blog/2020/08/07/finished-reading-harrow.html",
				
				"content_html": "<p>Finished reading: <a href=\"https://micro.blog/books/9781250313218\">Harrow the Ninth</a> by Tamsyn Muir 📚</p>\n",
				"content_text": "Finished reading: [Harrow the Ninth](https://micro.blog/books/9781250313218) by Tamsyn Muir 📚\n",
				"date_published": "2020-08-07T11:44:58+05:30",
				"url": "https://blog.sarvagnan.com/2020/08/07/finished-reading-harrow.html",
				"tags": ["fiction","good"]
			},
			{
				"id": "http://sarvagnan.micro.blog/2020/08/05/zach-lowe-on.html",
				
				"content_html": "<p><a href=\"https://www.espn.in/nba/story/_/page/nbareturn29571626/why-some-nba-coaches-love-new-casual-look-some\">Zach Lowe on NBA coach fashion</a></p>\n\n<p>So many good quotes here. One example: Messina confirmed, via text, that he indeed has great taste</p>\n\n<p>🏀</p>\n",
				"content_text": "[Zach Lowe on NBA coach fashion] (https://www.espn.in/nba/story/_/page/nbareturn29571626/why-some-nba-coaches-love-new-casual-look-some)\n\nSo many good quotes here. One example: Messina confirmed, via text, that he indeed has great taste\n\n🏀\n",
				"date_published": "2020-08-05T22:30:00+05:30",
				"url": "https://blog.sarvagnan.com/2020/08/05/zach-lowe-on.html"
			},
			{
				"id": "http://sarvagnan.micro.blog/2020/08/05/finished-reading-the.html",
				
				"content_html": "<p>Finished reading: <a href=\"https://micro.blog/books/9780765398574\">The Impossible Contract</a> by K.A. Doore 📚</p>\n",
				"content_text": "Finished reading: [The Impossible Contract](https://micro.blog/books/9780765398574) by K.A. Doore 📚\n",
				"date_published": "2020-08-05T21:09:46+05:30",
				"url": "https://blog.sarvagnan.com/2020/08/05/finished-reading-the.html",
				"tags": ["fiction"]
			},
			{
				"id": "http://sarvagnan.micro.blog/2020/08/03/finished-reading-the.html",
				
				"content_html": "<p>Finished reading: <a href=\"https://micro.blog/books/9781250236968\">The Relentless Moon</a> by Mary Robinette Kowal 📚</p>\n",
				"content_text": "Finished reading: [The Relentless Moon](https://micro.blog/books/9781250236968) by Mary Robinette Kowal 📚\n",
				"date_published": "2020-08-03T09:51:33+05:30",
				"url": "https://blog.sarvagnan.com/2020/08/03/finished-reading-the.html",
				"tags": ["fiction","good"]
			},
			{
				"id": "http://sarvagnan.micro.blog/2020/08/02/finished-reading-the.html",
				
				"content_html": "<p>Finished reading: <a href=\"https://micro.blog/books/9780765398550\">The Perfect Assassin</a> by K.A. Doore 📚</p>\n",
				"content_text": "Finished reading: [The Perfect Assassin](https://micro.blog/books/9780765398550) by K.A. Doore 📚\n",
				"date_published": "2020-08-02T13:50:37+05:30",
				"url": "https://blog.sarvagnan.com/2020/08/02/finished-reading-the.html",
				"tags": ["fiction"]
			},
			{
				"id": "http://sarvagnan.micro.blog/2020/08/01/finished-reading-the.html",
				
				"content_html": "<p>Finished reading: <a href=\"https://micro.blog/books/9780765387394\">The Angel of the Crows</a> by Katherine Addison 📚</p>\n",
				"content_text": "Finished reading: [The Angel of the Crows](https://micro.blog/books/9780765387394) by Katherine Addison 📚\n",
				"date_published": "2020-08-01T18:21:55+05:30",
				"url": "https://blog.sarvagnan.com/2020/08/01/finished-reading-the.html",
				"tags": ["fiction"]
			},
			{
				"id": "http://sarvagnan.micro.blog/2020/07/29/finished-reading-a.html",
				
				"content_html": "<p>Finished reading: <a href=\"https://micro.blog/books/9780451472984\">A Brightness Long Ago</a> by Guy Gavriel Kay 📚</p>\n",
				"content_text": "Finished reading: [A Brightness Long Ago](https://micro.blog/books/9780451472984) by Guy Gavriel Kay 📚\n",
				"date_published": "2020-07-29T21:30:30+05:30",
				"url": "https://blog.sarvagnan.com/2020/07/29/finished-reading-a.html",
				"tags": ["fiction","good"]
			},
			{
				"id": "http://sarvagnan.micro.blog/2020/07/23/dates-cake.html",
				
				"content_html": "<p>Dates cake</p>\n\n<p><img src=\"https://sarvagnan.micro.blog/uploads/2020/a3b6ea25cf.jpg\" width=\"600\" height=\"600\" alt=\"\" /></p>\n",
				"content_text": "Dates cake\n\n<img src=\"https://sarvagnan.micro.blog/uploads/2020/a3b6ea25cf.jpg\" width=\"600\" height=\"600\" alt=\"\" />\n",
				"date_published": "2020-07-23T00:23:27+05:30",
				"url": "https://blog.sarvagnan.com/2020/07/23/dates-cake.html"
			},
			{
				"id": "http://sarvagnan.micro.blog/2020/07/22/thought-on-first.html",
				
				"content_html": "<p>Thought on first forays through the site: the discover feed is so nice. I&rsquo;d prefer using this as a place for capture like Dave Winer with scripting news. Blogging hasn&rsquo;t stuck for me yet, but we&rsquo;ll see how this goes.</p>\n",
				"content_text": "Thought on first forays through the site: the discover feed is so nice. I'd prefer using this as a place for capture like Dave Winer with scripting news. Blogging hasn't stuck for me yet, but we'll see how this goes.\n",
				"date_published": "2020-07-22T00:34:00+05:30",
				"url": "https://blog.sarvagnan.com/2020/07/22/thought-on-first.html"
			},
			{
				"id": "http://sarvagnan.micro.blog/2020/07/22/sponge-cake.html",
				
				"content_html": "<p>Sponge cake</p>\n\n<p><img src=\"uploads/2020/d43e5223a1.jpg\" width=\"600\" height=\"450\" alt=\"\" /></p>\n",
				"content_text": "Sponge cake\n\n<img src=\"uploads/2020/d43e5223a1.jpg\" width=\"600\" height=\"450\" alt=\"\" />\n",
				"date_published": "2020-07-22T00:25:00+05:30",
				"url": "https://blog.sarvagnan.com/2020/07/22/sponge-cake.html",
				"tags": ["Baking"]
			},
			{
				"id": "http://sarvagnan.micro.blog/2020/07/18/currently-reading-the.html",
				
				"content_html": "<p>Currently reading: <a href=\"https://micro.blog/books/9780062868930\">The Guest List</a> 📚</p>\n",
				"content_text": "Currently reading: [The Guest List](https://micro.blog/books/9780062868930) 📚\n",
				"date_published": "2020-07-18T18:23:11+05:30",
				"url": "https://blog.sarvagnan.com/2020/07/18/currently-reading-the.html",
				"tags": ["fiction"]
			}
	]
}
